////////////////////////////////////////////////////////////////////////////////
//                                                                            
//  File:           IPublisher.cs
//
//  Facility:       Передача данных на сервер.
//
//
//  Abstract:       Интерфейс для передачи сведений на сервер.
//
//  Environment:    VC# 7.1
//
//  Author:         Зайцев С. А.
//
//  Creation Date:  14/09/2005
//
////////////////////////////////////////////////////////////////////////////////

/*
 * $History: IPublisher.cs $
 * 
 * *****************  Version 3  *****************
 * User: Sergey       Date: 18.11.06   Time: 14:37
 * Updated in $/gps/Lightcom.Common
 * 
 */

using System;
using System.IO;

namespace LightCom.Common
{
/// 
/// <summary>
/// Интерфейс для передачи сведений на сервер.
/// </summary>
/// 

public interface IPublisher
{

//////////////////////////////////////////////////////////////////////////////// 
/// 
/// <summary>
/// Передает данные на сервер и получает ответ.
/// </summary>
/// <param name="data">Передаваемые на сервер данные.</param>
/// <param name="receiveStream">Ответ сервера</param>
/// <returns>Возвращает true, если передача прошла успешно.</returns>
/// 
//////////////////////////////////////////////////////////////////////////////// 

bool Publish (byte [] data, out Stream receiveStream);

//////////////////////////////////////////////////////////////////////////////// 
///
/// <summary>
/// User agent.
/// </summary>
///
//////////////////////////////////////////////////////////////////////////////// 

string UserAgent
{
    get;  set;
}


//////////////////////////////////////////////////////////////////////////////// 
/// 
/// <summary>
/// Возвращает строку с описанием статуса ваыполнения последней 
/// операции.
/// </summary>
/// 
//////////////////////////////////////////////////////////////////////////////// 

string Status
{
    get;
}

}
}
