////////////////////////////////////////////////////////////////////////////////
//                                                                            
//  File:           ISettings.cs
//
//  Facility:       Хранение настроек.
//
//
//  Abstract:       Модуль содержит определение интерфейса, который будут 
//                  реализовывать классы, которы необходимо хранить свои 
//                  настройки.
//
//  Environment:    VC# 7.1
//
//  Author:         Зайцев С. А.
//
//  Creation Date:  13/09/2005
//
//  Copyright (C) OOO "ЛайтКом", 2005-2006. Все права защищены.
//
////////////////////////////////////////////////////////////////////////////////

/*
 * $History: ISettings.cs $
 * 
 * *****************  Version 3  *****************
 * User: Sergey       Date: 18.11.06   Time: 14:37
 * Updated in $/gps/Lightcom.Common
 * 
 */

using System;

namespace LightCom.Common
{
/// 
/// <summary>
/// Интерфейс сохранения настроек объекта.
/// </summary>
/// 

public interface ISettings 
{

//////////////////////////////////////////////////////////////////////////////// 
/// 
/// <summary>
/// Сбрасывает состояние объекта в начальное состояние.
/// </summary>
/// 
//////////////////////////////////////////////////////////////////////////////// 

void Reset ();

//////////////////////////////////////////////////////////////////////////////// 
/// 
/// <summary>
/// Сохраняет настройки объекта в заданном хранилище.
/// </summary>
/// <param name="storage">Интерфейс сохранения параметров.</param>
/// <returns>Возвращает true, если сохранение прошло успешно.
/// </returns>
/// 
//////////////////////////////////////////////////////////////////////////////// 

bool Save (SettingsStorage storage);

//////////////////////////////////////////////////////////////////////////////// 
/// 
/// <summary>
/// Загружает настройки объекта из заданного хранилища.
/// </summary>
/// <param name="storage">Интерфейс сохранения параметров.</param>
/// <returns>Возвращает true, если загрузка прошла успешно.
/// </returns>
///
//////////////////////////////////////////////////////////////////////////////// 

bool Load (SettingsStorage storage);
}
}


